ИТ_Фирма/src/Documents/РеализацияТоваровИУслуг/РеализацияТоваровИУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровИУслуг</name>
  <registerRecords>AccumulationRegister.Расходы</registerRecords>
  <registerRecords>AccumulationRegister.Товары</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетСКонтрагентами</registerRecords>
  <registerRecords>AccumulationRegister.Доходы</registerRecords>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.Денежный</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количественный</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Денежный</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Денежный</types>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИТ_Фирма/src/AccumulationRegisters/Товары/Товары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Товары</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количественный</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Денежный</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ИТ_Фирма/src/AccountingRegisters/Управленческий/Управленческий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Управленческий</name>
  <chartOfAccounts>ChartOfAccounts.Управленческий</chartOfAccounts>
  <correspondence>true</correspondence>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
    <balance>true</balance>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количественный</types>
    </type>
    <balance>true</balance>
  </resources>
</mdclass:AccountingRegister>

ИТ_Фирма/src/AccumulationRegisters/ВзаиморасчетСКонтрагентами/ВзаиморасчетСКонтрагентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетСКонтрагентами</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ИТ_Фирма/src/AccumulationRegisters/Доходы/Доходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Доходы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количественный</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ИТ_Фирма/src/AccumulationRegisters/Расходы/Расходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Расходы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ИТ_Фирма/src/Enums/ТипНоменклатуры/ТипНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипНоменклатуры</name>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>Товар</name>
  </enumValues>
</mdclass:Enum>

ИТ_Фирма/src/ChartsOfAccounts/Управленческий/Управленческий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Управленческий</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>Товары</name>
      <description>Товары</description>
      <code>41. </code>
    </items>
    <items>
      <name>ДенежныеСредства</name>
      <description>Денежные средства</description>
      <code>50. </code>
    </items>
    <items>
      <name>РасчетыСПоставщиками</name>
      <description>Расчеты с поставщиками</description>
      <code>60. </code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>РасчетыСПокупателями</name>
      <description>Расчеты с покупателями</description>
      <code>62. </code>
    </items>
    <items>
      <name>РасчетыССотрудниками</name>
      <description>Расчеты с сотрудниками</description>
      <code>70. </code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>Продажи</name>
      <description>Продажи</description>
      <code>90. </code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>Выручка</name>
        <description>Выручка</description>
        <code>90.1</code>
        <accountType>Passive</accountType>
      </childItems>
      <childItems>
        <name>Расходы</name>
        <description>Расходы</description>
        <code>90.2</code>
      </childItems>
    </items>
  </predefined>
  <extDimensionAccountingFlags>
    <name>Суммовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
  <extDimensionAccountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

ИТ_Фирма/src/ChartsOfCharacteristicTypes/ВидыСубконто/ВидыСубконто.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыСубконто</name>
  <type>
    <types>CatalogRef.Сотрудники</types>
    <types>CatalogRef.Номенклатура</types>
    <types>CatalogRef.Контрагенты</types>
  </type>
  <predefined>
    <items>
      <name>Контрагенты</name>
      <description>Контрагенты</description>
      <code>000000003</code>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </items>
    <items>
      <name>Номенклатура</name>
      <description>Номенклатура</description>
      <code>000000002</code>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </items>
    <items>
      <name>Сотрудники</name>
      <description>Сотрудники</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

ИТ_Фирма/src/Documents/РеализацияТоваровИУслуг/ObjectModule.bsl
Процедура ОбработкаЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Ответственный = СотрудникиВызовСервера.СотрудникТекущегоПользователя();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаДокумента = Товары.Итог("Сумма");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Товары.Записывать = Истина;
	Движения.Товары.Очистить();
	Движения.Товары.Записать();
	
	Движения.Управленческий.Очистить();
	

	//Взаиморасчеты с контрагентами Приход
	Движения.ВзаиморасчетСКонтрагентами.Записывать = Истина;
	ДвиженияВзаиморасчет = Движения.ВзаиморасчетСКонтрагентами.Добавить();
	ДвиженияВзаиморасчет.ВидДвижения = ВидДвиженияНакопления.Приход;
	ДвиженияВзаиморасчет.Период = Дата;
	ДвиженияВзаиморасчет.Контрагент = Контрагент;
	ДвиженияВзаиморасчет.Сумма = СуммаДокумента;
	
	//Регистр бухгалтерии Управленческий счета 90.1 и 62
	
	Движения.Управленческий.Записывать = Истина;
	ДвижениеУправленческий = Движения.Управленческий.Добавить();
	ДвижениеУправленческий.СчетДт = ПланыСчетов.Управленческий.РасчетыСПокупателями;
	ДвижениеУправленческий.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Контрагент;
	ДвижениеУправленческий.СчетКт = ПланыСчетов.Управленческий.Выручка;
	ДвижениеУправленческий.Период = Дата;
	ДвижениеУправленческий.Сумма = СуммаДокумента;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеализацияТоваровИУслугТовары.Номенклатура КАК Номенклатура,
	               |	СУММА(РеализацияТоваровИУслугТовары.Количество) КАК КоличествоРеализация,
	               |	РеализацияТоваровИУслугТовары.Сумма КАК СуммаРеализация,
	               |	МИНИМУМ(РеализацияТоваровИУслугТовары.НомерСтроки) КАК НомерСтроки,
	               |	РеализацияТоваровИУслугТовары.Номенклатура.ТипНоменклатуры КАК НоменклатураТипНоменклатуры
	               |ПОМЕСТИТЬ ВТ_Товары
	               |ИЗ
	               |	Документ.РеализацияТоваровИУслуг.Товары КАК РеализацияТоваровИУслугТовары
	               |ГДЕ
	               |	РеализацияТоваровИУслугТовары.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровИУслугТовары.Номенклатура,
	               |	РеализацияТоваровИУслугТовары.Номенклатура.ТипНоменклатуры,
	               |	РеализацияТоваровИУслугТовары.Сумма
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Товары.Номенклатура КАК Номенклатура,
	               |	ВТ_Товары.КоличествоРеализация КАК КоличествоРеализация,
	               |	ВТ_Товары.СуммаРеализация КАК СуммаРеализация,
	               |	ВТ_Товары.НомерСтроки КАК НомерСтроки,
	               |	ВТ_Товары.НоменклатураТипНоменклатуры КАК ТипНоменклатуры,
	               |	ЕСТЬNULL(УправленческийОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокБухгалтерия,
	               |	ЕСТЬNULL(УправленческийОстатки.СуммаОстаток, 0) КАК СуммаОстатокБухгалтерия,
	               |	ЕСТЬNULL(ТоварыОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	               |	ЕСТЬNULL(ТоварыОстатки.СуммаОстаток, 0) КАК СуммаОстаток
	               |ИЗ
	               |	ВТ_Товары КАК ВТ_Товары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Управленческий.Остатки(
	               |				&Дата,
	               |				Счет = &Счет,
	               |				&Cубконто,
	               |				Субконто1 В
	               |					(ВЫБРАТЬ
	               |						ВТ_Товары.Номенклатура КАК Номенклатура
	               |					ИЗ
	               |						ВТ_Товары КАК ВТ_Товары)) КАК УправленческийОстатки
	               |		ПО ВТ_Товары.Номенклатура = УправленческийОстатки.Субконто1,
	               |	РегистрНакопления.Товары.Остатки(
	               |			&Дата,
	               |			Номенклатура В
	               |				(ВЫБРАТЬ
	               |					ВТ_Товары.Номенклатура КАК Номенклатура
	               |				ИЗ
	               |					ВТ_Товары КАК ВТ_Товары)) КАК ТоварыОстатки";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", МоментВремени());
	Запрос.УстановитьПараметр("Cубконто", ПланыВидовХарактеристик.ВидыСубконто.Номенклатура);
	ЗАпрос.УстановитьПараметр("Счет", ПланыСчетов.Управленческий.Товары);
		
	РезультатЗапроса= Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Движения.Доходы.Записывать = Истина;
	
	Движения.Товары.Записывать = Истина; 
	
	Движения.Расходы.Записывать = Истина;
	Пока Выборка.Следующий() Цикл
		
		ДвижениеДоходы = Движения.Доходы.Добавить();
		ДвижениеДоходы.Период = Дата;
		ДвижениеДоходы.Номенклатура = Выборка.Номенклатура;
		ДвижениеДоходы.Количество = Выборка.КоличествоРеализация;
		ДвижениеДоходы.Сумма = Выборка.СуммаРеализация;
		
		
		Если Выборка.ТипНоменклатуры = Перечисления.ТипНоменклатуры.Товар Тогда
			
			ДвижениеТовары = Движения.Товары.Добавить();
		    ДвижениеТовары.Номенклатура = Выборка.Номенклатура;
			ДвижениеТовары.ВидДвижения = ВидДвиженияНакопления.Расход;
			ДвижениеТовары.Период = Дата;
			
			Если Выборка.КоличествоОстаток >= Выборка.КоличествоРеализация Тогда
				
				ДвижениеТовары.Количество = Выборка.КоличествоРеализация;			
				
				Если Выборка.КоличествоОстаток = Выборка.КоличествоРеализация Тогда
					
					СуммаРасхода = Выборка.СуммаОстаток;
					РасходБухгалтерия = Выборка.СуммаОстатокБухгалтерия;
					ДвижениеТовары.Сумма = СуммаРасхода;
					
				Иначе                                                 	
					
					Себестоимость = Выборка.СуммаОстаток / Выборка.КоличествоОстаток;
					СебестоимостьДляБухгалтерии = Выборка.СуммаОстатокБухгалтерия / Выборка.КоличествоОстатокБухгалтерия;
					РасходБухгалтерия = СебестоимостьДляБухгалтерии * Выборка.КоличествоРеализация;
					СуммаРасхода = Себестоимость * Выборка.КоличествоРеализация;
					ДвижениеТовары.Сумма = СуммаРасхода;
					
				КонецЕсли;
				
			Иначе 
				
				НедостатокТовара = Выборка.КоличествоРеализация - Выборка.КоличествоОстаток;
				ШаблонСообщения = "Товара %1 недостаточно на складе. В количестве: %2";
				Сообщение = Новый СообщениеПользователю;
				Сообщение.УстановитьДанные(ЭтотОбъект);
				Сообщение.Текст = СтрШаблон(ШаблонСообщения,
					Выборка.Номенклатура,
					НедостатокТовара);
				ШаблонПоле = "Товары[%1].Количество";	
				Сообщение.Поле = СтрШаблон(ШаблонПоле, XMLСтрока(Выборка.НомерСтроки -1));	
				Сообщение.Сообщить();
				
				Отказ = Истина;
				
			КонецЕсли;	
			
			ДвижениеРасходы = Движения.Расходы.Добавить();
			ДвижениеРасходы.Период = Дата;
			ДвижениеРасходы.Номенклатура = Выборка.Номенклатура;
			ДвижениеРасходы.Сумма = СуммаРасхода;
			
			//Движение по счетам 90.2 и 41
			ДвижениеУправленческий = Движения.Управленческий.Добавить();
			ДвижениеУправленческий.СчетДт = ПланыСчетов.Управленческий.Расходы;
			ДвижениеУправленческий.СчетКт = ПланыСчетов.Управленческий.Товары;
			ДвижениеУправленческий.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = Выборка.Номенклатура;
			ДвижениеУправленческий.Сумма = РасходБухгалтерия; 
			ДвижениеУправленческий.Период = Дата;
			ДвижениеУправленческий.Количество = Выборка.КоличествоРеализация;
		КонецЕсли;
		
		
	КонецЦикла;	
	
КонецПроцедуры
